## Importing necessary libraries

In [1]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler

## Importing Dataset

In [2]:
df = pd.read_csv("dataset.csv",low_memory = False)

## Printing first 5 rows of the dataset

In [3]:
df.head(n=5)

,step,type,amount,nameOrig,oldbalanceOrg,newbalanceOrig,nameDest,oldbalanceDest,newbalanceDest,isFraud,isFlaggedFraud
0,1,PAYMENT,9839.64,C1231006815,170136.0,160296.36,M1979787155,0.0,0.0,0,0
1,1,PAYMENT,1864.28,C1666544295,21249.0,19384.72,M2044282225,0.0,0.0,0,0
2,1,TRANSFER,181.00,C1305486145,181.0,0.00,C553264065,0.0,0.0,1,0
3,1,CASH_OUT,181.00,C840083671,181.0,0.00,C38997010,21182.0,0.0,1,0
4,1,PAYMENT,11668.14,C2048537720,41554.0,29885.86,M1230701703,0.0,0.0,0,0

## Dropping unnecessary columns

In [4]:
new_df= df.drop(['step','nameOrig','nameDest','isFlaggedFraud','oldbalanceDest','newbalanceDest'], axis = 1)

## Printing the first 10 rows of the new formed dataset

In [5]:
new_df.head(n = 10)

       type    amount  oldbalanceOrg  newbalanceOrig  isFraud
0   PAYMENT   9839.64      170136.00       160296.36        0
1   PAYMENT   1864.28       21249.00        19384.72        0
2  TRANSFER    181.00         181.00            0.00        1
3  CASH_OUT    181.00         181.00            0.00        1
4   PAYMENT  11668.14       41554.00        29885.86        0
5   PAYMENT   7817.71       53860.00        46042.29        0
6   PAYMENT   7107.77      183195.00       176087.23        0
7   PAYMENT   7861.64      176087.23       168225.59        0
8   PAYMENT   4024.36        2671.00            0.00        0
9     DEBIT   5337.77       41720.00        36382.23        0

## Converting Categorical data into a numeric data

In [6]:
new_df['type']=new_df['type'].map({'PAYMENT':1, 'TRANSFER':4, 'CASH_OUT':2, 'DEBIT':5, 'CASH_IN':3})

## Printing the new dataset after the necessary changes

In [7]:
new_df.head()

   type    amount  oldbalanceOrg  newbalanceOrig  isFraud
0     1   9839.64       170136.0       160296.36        0
1     1   1864.28        21249.0        19384.72        0
2     4    181.00          181.0            0.00        1
3     2    181.00          181.0            0.00        1
4     1  11668.14        41554.0        29885.86        0

## Extracting Features (X) and Target (y) from DataFrame

In [8]:
X = new_df.iloc[:,:-1].values
y = new_df.iloc[:,-1].values

## Splitting Data into Training and Test Sets

In [9]:
X_train, X_test, y_train,y_test = train_test_split(X,y, test_size = 0.25, random_state = 0)

## Feature Scaling with Standardization for Machine Learning

In [10]:
sc = StandardScaler()
X_train = sc.fit_transform(X_train)
X_test = sc.transform(X_test)